{   "featured": {
        "10df45bb-717b-4b9a-b47d-62cddf00975f": {
            "name": "Ficus",
            "nameBinominal": "Ficus retusa or ginseng",
            "imageUrl": "../src/assets/ficus-bonsai.jpg",
            "category": "Broadleaf evergreen",
            "_id": "10df45bb-717b-4b9a-b47d-62cddf00975f"
        },
        "b81b054f-b0b0-47ea-955e-b3b998c4abe1": {
            "name": "Juniper",
            "nameBinominal": "Juniperius",
            "imageUrl": "../src/assets/juniper-bonsai.jpg",
            "category": "Pines and conifiers",
            "_id": "b81b054f-b0b0-47ea-955e-b3b998c4abe1"
        },
        "6e092a8f-40b2-429d-8f7a-114c98155529": {
            "name": "Japanese maple",
            "nameBinominal": "Acer palmatum",
            "imageUrl": "../src/assets/maple-bonsai.jpg",
            "category": "Deciduous",
            "_id": "6e092a8f-40b2-429d-8f7a-114c98155529"
        }
    },
    "species": {
        "10df45bb-717b-4b9a-b47d-62cddf00975f": {
            "name": "Ficus",
            "nameBinominal": "Ficus retusa or ginseng",
            "imageUrl": "../src/assets/ficus-bonsai.jpg",
            "category": "Broadleaf evergreen",
            "_id": "10df45bb-717b-4b9a-b47d-62cddf00975f"
        },
        "b81b054f-b0b0-47ea-955e-b3b998c4abe1": {
            "name": "Juniper",
            "nameBinominal": "Juniperius",
            "imageUrl": "../src/assets/juniper-bonsai.jpg",
            "category": "Pines and conifiers",
            "_id": "b81b054f-b0b0-47ea-955e-b3b998c4abe1"
        },
        "6e092a8f-40b2-429d-8f7a-114c98155529": {
            "name": "Japanese maple",
            "nameBinominal": "Acer palmatum",
            "imageUrl": "../src/assets/maple-bonsai.jpg",
            "category": "Deciduous",
            "_id": "6e092a8f-40b2-429d-8f7a-114c98155529"
        }
    },
    "details": {
        "10df45bb-717b-4b9a-b47d-62cddf00975f": {
            "name": "Ficus",
            "nameBinominal": "Ficus retusa or ginseng",
            "backgroundURL": "../src/assets/ficus.jpg",
            "imageUrl": "../src/assets/ficus-bonsai.jpg",
            "shortDescription": "The Ficus genus belongs to the family of mulberry plants or Moraceae, and it’s the most popular indoor tree species for Bonsai beginners. They can be found on every continent in the tropic regions and are very suitable for indoor Bonsai.",
            "category": "Broadleaf evergreen",
            "placement": "The ficus is an indoor tree that does not endure frosty conditions. It can be kept outside in the summer as long as temperatures are above 60°F (15°C). It requires a lot of light, preferably full sunlight, so be sure not to place it in a shady location. The temperature should be kept relatively constant. Figs can endure low humidity due to their thick, waxy leaves, but they prefer higher humidity and need extremely high humidity to develop aerial roots.",
            "watering": "Ignore labels stating your Ficus needs watering every day, you need to water on observation. The Ficus should be watered generously whenever the soil gets slightly dry. The Bonsai Ficus prefers room temperature soft water and it can tolerate occasional over, or underwatering. We advise daily misting to maintain humidity, but too much misting can create fungal problems. The warmer the placement of the fig during winter, the more water it needs. If it’s kept in a cooler place it only needs to be kept slightly moist.",
            "pestsAndDeseases": "Fig species are quite resistant against pests, but they are still susceptible to several issues depending on their location, and time of year, especially in the winter. Dry air and a lack of light weakens the Bonsai Ficus and often result in leaf drop. In poor conditions like these, they are sometimes infested with scale or spider mites. Placing customary insecticide sticks into the soil or spraying insecticide/miticide will get rid of the pests, but a weakened Ficus tree’s living conditions must be improved. Using plant lamps 12 to 14 hours a day, and frequently misting the leaves will help in the recovery process.",
            "_id": "10df45bb-717b-4b9a-b47d-62cddf00975f"
        },
        "b81b054f-b0b0-47ea-955e-b3b998c4abe1": {
            "name": "Juniper",
            "nameBinominal": "Juniperius",
            "backgroundURL": "../src/assets/bonsai-species-juniper.jpg",
            "imageUrl": "../src/assets/juniper-bonsai.jpg",
            "shortDescription": "The juniper genus is made up of about 50 to 70 different species within the cypress family. They are evergreen coniferous trees or shrubs, which are very popular for Bonsai. Junipers can have two types of foliage, needle-like, and scale-like foliage.",
            "category": "Pines and conifiers",
            "placement": "Place the tree outside, year-round, in a bright location with lots of sunlight. The Juniper cannot live indoors. During the winter protect the tree once temperatures drop below 15 °F (-10 °C), for example by placing it in a coldframe. Some species change their foliage color during frosty periods to a purplish brown which is a part of their internal frost protection mechanism. Don’t worry they will turn green again in spring.",
            "watering": "Be careful not to overwater, as the juniper’s roots don't like soil wetness. Before you water, the soil should slightly dry. Misting the tree can be done regularly, especially after the tree has been repotted because it benefits from air humidity.",
            "pestsAndDeseases": "If junipers are well cared for and placed in an ideal location they are very resistant to pests. Make sure not to allow foliage pads to get too dense otherwise, pests can settle in them more easily. During winter the junipers must be kept in a place with enough light and they must be checked for pests regularly even in winter. Junipers can sometimes get infested with spider mites, juniper scale, juniper aphids, and juniper needle miners as well as juniper webworms. Traditional insecticide/miticide sprays will help but if you want to get rid of pests, you should investigate why the tree was prone to infestation. Fungal rust diseases are a big problem. Juniper species have different levels of susceptibility to rust fungus. Some are even considered resistant to fungal rust diseases. As a rule of thumb, the blue-green junipers are more resistant than those with yellowish-green foliage. The Japanese junipers are also not infested often. You can find files that list many juniper species and cultivars and their susceptibility/resistance level to rust fungus on the internet. The rust fungus infests the junipers permanently and cannot be cured. It causes swellings that erupt with brown galls. During winter, particularly in rainy weather, the galls produce large, orange, gelatin-like tendrils, full of spores that infest the leaves of pear trees or hawthorn/crabapples. You can identify the fungus when you see orange spots on the pear leaves. In late summer brownish proliferations grow from the bottom-sides of the leaves which release spores that infest junipers. While the pear trees in most cases are not fatally affected – they are newly infected each year, and they can even be treated successfully with a fungicide. An infected juniper normally cannot be cured. The visibly infested branches die in most cases and the fungus can emerge on other tree parts. Removing the parts with the swellings and galls is no guarantee that the fungus will not reappear. Some people have a different opinion, but it’s best to burn rust-infested juniper immediately or put it into the garbage instead of your compost heap",
            "_id": "b81b054f-b0b0-47ea-955e-b3b998c4abe1"
        },
        "6e092a8f-40b2-429d-8f7a-114c98155529": {
            "name": "Japanese maple",
            "nameBinominal": "Acer palmatum",
            "backgroundURL": "../src/assets/bonsai-species-maple.jpg",
            "imageUrl": "../src/assets/maple-bonsai.jpg",
            "shortDescription": "The Japanese Maple, otherwise known as Acer palmatum, is originally from Japan, China, and Korea. It owes its botanical name to the hand-shaped leaves with five pointed lobes. Palma is Latin for palm, as in the palm of your hand.",
            "category": "Deciduous",
            "placement": "Japanese Maple Bonsai do really well in sunny and airy locations, but when temperatures rise to 85 °F (30 °C) or above, it should be placed somewhere with indirect sunlight to prevent the sun from damaging the leaves. The Japanese Maple is frost hardy, even when trained as a Bonsai, but when temperatures drop below 15 °F (-10 °C), it should be protected, for example by being placed in a coldframe.",
            "watering": "A Japanese Maple Bonsai must be watered daily during the growing season. During the hotter days in the growing season, it's sometimes necessary to water your tree several times, if the soil is well-drained and the tree is healthy and vigorous. As with all Bonsai, make sure to water on observation and not on a fixed schedule; the soil should never dry out completely. Avoid watering with calcareous water as the Japanese Maple prefers a neutral or slightly acid pH-value.",
            "pestsAndDeseases": "The Japanese Maple is a very sturdy tree species, but it can be affected by sap-sucking insects known as aphids in spring. Get rid of aphids with a standard insecticide spray, and follow the direction on the label. Verticillium wilt is a fungal disease that can cause the Japanese Maple Bonsai to partially or completely die. This disease is not treatable and can be transmitted to other trees via your Bonsai tools. You can identify it on fresh cuts as black spots in the wood. If you suspect Verticillium is present in your tree(s) be sure to thoroughly clean and disinfect your tools.",
            "_id": "6e092a8f-40b2-429d-8f7a-114c98155529"
        }
    },
    "pages": {
        "home": {
            "_id": "home",
            "backgroundImg": "./src/assets/home.jpg",
            "title": "The living art of Bonsai",
            "subtitle": "Bonsai World is a community built by enthusiasts and experts from around the world. We introduce you to the fascinating and living art of Bonsai, and help you get started!"
        },
        "bonsai-care": {
            "_id": "bonsai-care",
            "backgroundImg": "./src/assets/bonsai-care.jpg",
            "thumbImg": "./src/assets/Bonsai-care-techniques.jpg",
            "title": "Bonsai tree care",
            "subtitle": "Bonsai tree care and maintenance",
            "shortDescription": "Caring for a Bonsai tree is not nearly as difficult as it might seem. However, as Bonsai trees are planted in small pots there are a few basic guidelines for placement, watering, and repotting your trees.",
            "placement": "Determining what the optimal spot is to place your Bonsai trees can be hard, as several factors (local climate, time of year, etc.) should be taken into consideration. But the decisive factor is the tree species, and in particular; is your Bonsai an indoor or an outdoor tree?",           
            "watering": "The most important part of taking care of your Bonsai trees is watering. How often a tree needs to be watered depends on several factors such as; species of the tree, size of the tree, size of the pot, time of year, soil-mixture, and climate. I can’t tell you how often you should water Bonsai without knowing what kind of tree you have. However, understanding a few basic guidelines will help understand and identify when a tree needs to be watered.",
            "fertilizing": "Fertilizing regularly during the growing season is crucial for Bonsai to survive and thrive. Trees are usually able to extend their root system in search of nutrients, but since Bonsai are confined to the relatively small pots they are planted in, they need proper fertilization to replenish the soil's nutritional content.",
            "repotting": "To prevent your Bonsai from being pot-bound and ultimately starving to death, it's crucial to repot, or transplant regularly. A tree becomes pot-bound as it uses up the available nutrients in the soil and the roots grow to the shape of the pot. Due to the lack of space and nutrients, the trees stop growing, and if no action is taken, it will surely die. Repotting or transplanting your Bonsai will resupply the tree with the nutrients it needs to grow and flourish.",
            "soil": "Using the right soil mixture for your Bonsai trees is crucial. Soil is important to supply your trees with nutrients, but it also needs to drain properly, provide enough aeration, and retain water. Most online Bonsai shops offer ready-mixed soils, but preparing a soil mixture yourself saves money, and gives control over the exact mixture for your particular tree species.",
            "potSelection": "A tree is a tree, a pot is only a pot. It does not become a Bonsai until these two are combined and form a harmony together. A large part of the art of Bonsai is the experience of a tree that has become detached from its ground and now lives in a pot.",         
            "pestsAndDeseases": "Like any other living plant, Bonsai trees can be infected by any kind of pest or disease. However, when your plants are healthy and cared for properly, the risk of infection is reduced to a minimum."
        },
        "bonsai-styling": {
            "_id": "bonsai-styling",
            "backgroundImg": "./src/assets/bonsai-styling-bg.jpg",
            "thumbImg": "./src/assets/Styling-and-design-techniques.jpg",
            "title": "Bonsai styling",
            "subtitle": "Styling and shaping Bonsai trees",
            "shortDescription": "",
            "details": {
                "pruning": "",
                "wiring": "",
                "defoliation": "",
                "deadwood": "",
                "surfaceRoots": "",
                "trunk": ""
            }
        },
        "tree-species": {
            "_id": "tree-species",
            "backgroundImg": "./src/assets/bonsai-species.jpg",
            "thumbImg": "./src/assets/Popular-bonsai-tree-species.jpg",
            "title": "Popular tree species",
            "subtitle": "Care guides for the most popular Bonsai species",
            "shortDescription": "In this section, we'll take a closer look into tree-species that are used for growing Bonsai, and Bonsai tree types. Each tree species has specific requirements for its cultivation, training, and care, so Bonsai tree identification is crucial to take proper care of your tree."
        },
        "create-guide": {
            "_id": "create-guide",
            "backgroundImg": "./src/assets/create-guide.jpg",
            "title": "Create a new guide",
            "subtitle": "Use the form to create a new guide"
        }
    },
    "featuredPages": {
        "placement": {
            "_id": "placement",
            "backgroundImg": "./src/assets/Bonsai-techniques-placement.jpg",
            "thumbImg": "./src/assets/Bonsai-techniques-placement-thumb.jpg",
            "title": "Placement",
            "shortDescription": "Determining what the optimal spot is to place your Bonsai trees can be hard, as several factors (local climate, time of year, etc.) should be taken into consideration. But the decisive factor is the tree species, and in particular; is your Bonsai an indoor or an outdoor tree?"
        },
        "watering": {
            "_id": "watering",
            "backgroundImg": "./src/assets/bonsai-techniques-watering.jpg",
            "thumbImg": "./src/assets/bonsai-techniques-watering-thumb.jpg",
            "title": "Watering",
            "shortDescription": "The most important part of taking care of your Bonsai trees is watering. How often a tree needs to be watered depends on several factors such as; species of the tree, size of the tree, size of the pot, time of year, soil-mixture, and climate."
        },
        "pruning": {
            "_id": "pruning",
            "backgroundImg": "./src/assets/bonsai-techniques-pruning.jpg",
            "thumbImg": "./src/assets/bonsai-techniques-pruning-thumb.jpg",
            "title": "Pruning",
            "shortDescription": "Without a doubt, the most important way to style a Bonsai is to prune it regularly. There are two different techniques: maintenance-pruning, to maintain and refine the existing shape of a Bonsai, and a structural pruning, which involves more rigorous pruning to give a tree its basic shape."
        },
        "wiring": {
            "_id": "wiring",
            "backgroundImg": "./src/assets/bonsai-techniques-wire.jpg",
            "thumbImg": "./src/assets/bonsai-techniques-wire-thumb.jpg",
            "title": "Wiring",
            "shortDescription": "Wiring is a very important technique used to train and style Bonsai trees. By wrapping wire around the branches of a tree you can bend and reposition the branches to your liking. It takes a few months before the branches are set in their new position(s)."
        }
    }
}