{   "featured": {
        "10df45bb-717b-4b9a-b47d-62cddf00975f": {
            "name": "Ficus",
            "nameLatin": "Ficus retusa or ginseng",
            "imageUrl": "../src/assets/ficus-bonsai.jpg",
            "category": "Broadleaf evergreen",
            "_id": "10df45bb-717b-4b9a-b47d-62cddf00975f"
        },
        "b81b054f-b0b0-47ea-955e-b3b998c4abe1": {
            "name": "Juniper",
            "nameLatin": "Juniperius",
            "imageUrl": "../src/assets/juniper-bonsai.jpg",
            "category": "Pines and conifiers",
            "_id": "b81b054f-b0b0-47ea-955e-b3b998c4abe1"
        },
        "6e092a8f-40b2-429d-8f7a-114c98155529": {
            "name": "Japanese maple",
            "nameLatin": "Acer palmatum",
            "imageUrl": "../src/assets/maple-bonsai.jpg",
            "category": "Deciduous",
            "_id": "6e092a8f-40b2-429d-8f7a-114c98155529"
        }
    },
    "species": {
        "10df45bb-717b-4b9a-b47d-62cddf00975f": {
            "name": "Ficus",
            "nameLatin": "Ficus retusa or ginseng",
            "imageUrl": "../src/assets/ficus-bonsai.jpg",
            "category": "Broadleaf evergreen",
            "_id": "10df45bb-717b-4b9a-b47d-62cddf00975f"
        },
        "b81b054f-b0b0-47ea-955e-b3b998c4abe1": {
            "name": "Juniper",
            "nameLatin": "Juniperius",
            "imageUrl": "../src/assets/juniper-bonsai.jpg",
            "category": "Pines and conifiers",
            "_id": "b81b054f-b0b0-47ea-955e-b3b998c4abe1"
        },
        "6e092a8f-40b2-429d-8f7a-114c98155529": {
            "name": "Japanese maple",
            "nameLatin": "Acer palmatum",
            "imageUrl": "../src/assets/maple-bonsai.jpg",
            "category": "Deciduous",
            "_id": "6e092a8f-40b2-429d-8f7a-114c98155529"
        }
    },
    "details": {
        "10df45bb-717b-4b9a-b47d-62cddf00975f": {
            "name": "Ficus",
            "nameLatin": "Ficus retusa or ginseng",
            "backgroundURL": "someurl",
            "imageUrl": "../src/assets/ficus-bonsai.jpg",
            "category": "Broadleaf evergreen",
            "placement": "The ficus is an indoor tree that does not endure frosty conditions. It can be kept outside in the summer as long as temperatures are above 60°F (15°C). It requires a lot of light, preferably full sunlight, so be sure not to place it in a shady location. The temperature should be kept relatively constant. Figs can endure low humidity due to their thick, waxy leaves, but they prefer higher humidity and need extremely high humidity to develop aerial roots.",
            "watering": "Ignore labels stating your Ficus needs watering every day, you need to water on observation. The Ficus should be watered generously whenever the soil gets slightly dry. The Bonsai Ficus prefers room temperature soft water and it can tolerate occasional over, or underwatering. We advise daily misting to maintain humidity, but too much misting can create fungal problems. The warmer the placement of the fig during winter, the more water it needs. If it’s kept in a cooler place it only needs to be kept slightly moist.",
            "fertilizing": "Fertilize every two weeks during summer, and every four weeks during winter if the growth doesn't stop. Liquid fertilizer can be used as well as organic fertilizer pellets.",
            "pruningAndWiring": "Regular pruning is necessary to retain the tree’s shape. Prune back to 2 leaves after 6-8 leaves have grown. Leaf pruning (defoliation) can be used to reduce leaf size, as some Ficus Bonsai species normally grow large leaves. If a considerable thickening of the trunk is desired, the Ficus can be left to grow freely for one or two years. The strong cuts that are necessary afterward don't affect the Ficus' health and new shoots will grow from old wood. Larger wounds should be covered with cut paste. Wiring and bending thin to medium Ficus branches is easy due to their flexibility, but you should check the wires regularly as they can cut into the bark very quickly. Strong branches should be shaped with guy-wires because they can be left on the tree for a much longer period.",
            "repotting": "Repot your Ficus tree during the spring, every other year, using a basic Bonsai soil mixture. Ficus tolerates root-pruning very well.",
            "propagation": "Cuttings can be planted at any time of the year, but they have the highest success rate during mid-summer growth. Air-layering will work best during spring, in April through May. In most cases, springtime is the best time for planting Ficus seeds. Ficus trees can fuse by placing branches, roots, or trunks together and applying some pressure. This technique is known as approach-grafting and it can be used to form appealing structures. You can tie many young plants together to fuse them and build a single strong trunk. Fig tree branches and roots can also be grafted quite easily. If the growing conditions are ideal, you can even take aerial roots from one part of the tree and graft them into a different position. For faster healing, or closing of large wounds, young plants, shoots, or aerial roots can be grafted across wounds. An experienced grower can work on fig trees with a nearly unlimited range of creative freedom, which considerably increases the appeal of growing Ficus retusa as a Bonsai plant.",
            "buyingInfo": "Acquisition of ficus ginseng Bonsai: Ficus plants are available as cheap Bonsai or pot plants in nearly every home-improvement store or nursery. Mass-produced cheap Bonsai usually come with a lot of problems, like ugly scars from rusty wire that dug into the bark, unattractive shapes, often poorly grafted branches in odd positions, bad soil, and sometimes inappropriate pots without drainage holes. When you buy from specialized Bonsai traders you’ll most often find high-quality Bonsai that have been well cared for. They offer everything from young plants, pre-Bonsai, and pre-styled Ficus trees up to high-value Bonsai trees.",
            "pestsAndDeseases": "Fig species are quite resistant against pests, but they are still susceptible to several issues depending on their location, and time of year, especially in the winter. Dry air and a lack of light weakens the Bonsai Ficus and often result in leaf drop. In poor conditions like these, they are sometimes infested with scale or spider mites. Placing customary insecticide sticks into the soil or spraying insecticide/miticide will get rid of the pests, but a weakened Ficus tree’s living conditions must be improved. Using plant lamps 12 to 14 hours a day, and frequently misting the leaves will help in the recovery process.",
            "generalInformation": "Depending on where you look, there is different information as to the exact number of existing Ficus tree species. We know that there may be between 800 and 2000 different species. The most popular one for Bonsai is the Ficus Retusa. It’s often shaped with an s-curved trunk and has dark green oval leaves. Similar Ficus varieties include; The Microcarpa, Tigerbark, Willow leaf, Golden Gate, Religiosa, Benjamina, and Taiwan. The Ficus Ginseng is another popular tree with a thick, pot-bellied trunk, similar to the Ginseng root. Sometimes it is grafted with Ficus microcarpa leaves (combining it to a Ficus microcarpa ginseng). <br> Some figs trees can grow very large with a crown circumference of more than 1000 ft (300 m). All fig Bonsai species share a milky latex sap which leaks from wounds or cuts. The tropical figs are evergreen trees, small shrubs, or even climbing plants. Some of them can produce nice flowers, while most Ficus species have hidden flowers in small receptacles from which their fruits grow. Only specialized pollinating fig wasps can pollinate those hidden flowers. The fruit can be yellow, green, red, or purple-blue and are between a few millimeters to several centimeters, as the edible fruit of Ficus carica. Something to be aware of is that Ficus Ginseng Bonsai plants are poisonous for animals, especially if they eat the leaves. If you have pets, make sure to place your Ficus out of their reach.",
            "imagesURL": [],
            "_id": "10df45bb-717b-4b9a-b47d-62cddf00975f"
        },
        "b81b054f-b0b0-47ea-955e-b3b998c4abe1": {
            "name": "Juniper",
            "nameLatin": "Juniperius",
            "backgroundURL": "someurl",
            "imageUrl": "../src/assets/juniper-bonsai.jpg",
            "category": "Pines and conifiers",
            "placement": "Place the tree outside, year-round, in a bright location with lots of sunlight. The Juniper cannot live indoors. During the winter protect the tree once temperatures drop below 15 °F (-10 °C), for example by placing it in a coldframe. Some species change their foliage color during frosty periods to a purplish brown which is a part of their internal frost protection mechanism. Don’t worry they will turn green again in spring.",
            "watering": "Be careful not to overwater, as the juniper’s roots don't like soil wetness. Before you water, the soil should slightly dry. Misting the tree can be done regularly, especially after the tree has been repotted because it benefits from air humidity.",
            "fertilizing": "Use normal organic fertilizer pellets every month during the growing season or a liquid fertilizer every week. If you’d like to see strong growth you can apply some higher nitrogen levels in the spring.",
            "pruningAndWiring": "To develop the foliage pads, long shoots that stick out of the silhouette can be pinched or cut at the base with sharp scissors throughout the growing season. Do not trim the juniper like a hedge because the removal of all growing tips will weaken the tree and the cut will turn the needles brown. When the foliage pads become too dense they must be thinned out with sharp scissors at the base. The Juniper Bonsai is generally a strong tree that also withstands aggressive pruning very well. But it cannot bud again from bare tree parts, so take care that there is some foliage left on every branch you wish to keep alive.",
            "repotting": "Repot the Juniper Bonsai tree once every two years using a basic, or slightly more draining soil mixture. Very old trees can be repotted at longer intervals. Do not prune the roots too aggressively. The best moment to repot is the early spring.",
            "propagation": "Use seeds or cuttings for propagation. Many well-suited juniper species in different sizes can be found in most nurseries. You can usually find good raw material for Bonsai there. Old junipers can be found in gardens, concrete pots, and on cemeteries, with old graves that will be cleared, and if you are lucky the owner will allow you to dig one out for little money or a new plant. Specialized Bonsai traders offer everything from young plants, pre-Bonsai, and pre-styled juniper trees up to high-value Bonsai in various styles and shapes.",
            "buyingInfo": "N/A",
            "pestsAndDeseases": "If junipers are well cared for and placed in an ideal location they are very resistant to pests. Make sure not to allow foliage pads to get too dense otherwise, pests can settle in them more easily. During winter the junipers must be kept in a place with enough light and they must be checked for pests regularly even in winter. Junipers can sometimes get infested with spider mites, juniper scale, juniper aphids, and juniper needle miners as well as juniper webworms. Traditional insecticide/miticide sprays will help but if you want to get rid of pests, you should investigate why the tree was prone to infestation. Fungal rust diseases are a big problem. Juniper species have different levels of susceptibility to rust fungus. Some are even considered resistant to fungal rust diseases. As a rule of thumb, the blue-green junipers are more resistant than those with yellowish-green foliage. The Japanese junipers are also not infested often. You can find files that list many juniper species and cultivars and their susceptibility/resistance level to rust fungus on the internet. The rust fungus infests the junipers permanently and cannot be cured. It causes swellings that erupt with brown galls. During winter, particularly in rainy weather, the galls produce large, orange, gelatin-like tendrils, full of spores that infest the leaves of pear trees or hawthorn/crabapples. You can identify the fungus when you see orange spots on the pear leaves. In late summer brownish proliferations grow from the bottom-sides of the leaves which release spores that infest junipers. While the pear trees in most cases are not fatally affected – they are newly infected each year, and they can even be treated successfully with a fungicide. An infected juniper normally cannot be cured. The visibly infested branches die in most cases and the fungus can emerge on other tree parts. Removing the parts with the swellings and galls is no guarantee that the fungus will not reappear. Some people have a different opinion, but it’s best to burn rust-infested juniper immediately or put it into the garbage instead of your compost heap",
            "generalInformation": "The Juniper Bonsai trees that can be found in large stores, like Walmart and Home Depot, are often Japanese Garden Junipers, also known as Green Mound Junipers (Juniperus procumbens nana.) Other popular species include the Chinese juniper (Juniperus Chinensis,) the Japanese Shimpaku (Juniperus sargentii,) the Japanese needle juniper (Juniperus rigida,) two central European species: The savin (Juniperus sabina,) and the common juniper (Juniperus communis.) It also includes three American species: The California Juniper (Juniperus californica,) the Rocky Mountain Juniper (Juniperus scopulorum,) and the Sierra Juniper (Juniperus occidentalis). All of which have very similar care guidelines. Scale junipers’ new growth, or juvenile foliage, appears needle-like until the typical scale-like foliage appears when they mature. Juvenile growth can also result from heavy pruning, bending, or overwatering and can last as long as a few years until the normal scale-like foliage grows and the young needle-like foliage falls or can be removed. The foliage color can range from steely-blue-greens to light greens, occasionally with silver or gold hues. The berry-like cones are round or oval and are filled with round or edged seeds. Junipers are also great for jin and shari, or deadwood. It grows live veins below broken or dying branches that dry out and die to make deadwood.",
            "imagesURL": [],
            "_id": "b81b054f-b0b0-47ea-955e-b3b998c4abe1"
        },
        "6e092a8f-40b2-429d-8f7a-114c98155529": {
            "name": "Japanese maple",
            "nameLatin": "Acer palmatum",
            "backgroundURL": "someurl",
            "imageUrl": "../src/assets/maple-bonsai.jpg",
            "category": "Deciduous",
            "placement": "Japanese Maple Bonsai do really well in sunny and airy locations, but when temperatures rise to 85 °F (30 °C) or above, it should be placed somewhere with indirect sunlight to prevent the sun from damaging the leaves. The Japanese Maple is frost hardy, even when trained as a Bonsai, but when temperatures drop below 15 °F (-10 °C), it should be protected, for example by being placed in a coldframe.",
            "watering": "A Japanese Maple Bonsai must be watered daily during the growing season. During the hotter days in the growing season, it's sometimes necessary to water your tree several times, if the soil is well-drained and the tree is healthy and vigorous. As with all Bonsai, make sure to water on observation and not on a fixed schedule; the soil should never dry out completely. Avoid watering with calcareous water as the Japanese Maple prefers a neutral or slightly acid pH-value.",
            "fertilizing": "Solid, organic fertilizers contain all the required micronutrients, and they take effect slowly and gently. They are very well-proven, especially for more mature Japanese Maple Bonsai. Be sure to follow the instructions carefully for the proper dosage. If you'd like a stronger growth on young plants or raw material, you can combine your regular dosage with a liquid fertilizer once a week. Avoid fertilizers with a high nitrogen concentration to avoid unnecessarily large leaves and internodes.",
            "pruningAndWiring": "Trimming shoots and twigs can be done year-round. Strong branches should be pruned in autumn or summer, when callus growth is quick, to prevent excessive bleeding. When pruning thick branches we advise using a cut paste product to prevent fungal diseases that can enter through pruning wounds. The Maple is particularly vulnerable to some fungal infections and diseases. New growth should be pruned back to one or two pairs of leaves. Mature Bonsai with a delicate ramification can be pinched in order to keep the twigs thin. After the first leaf pair has unfolded, remove the soft little tip of the shoot between them to prevent the twigs from thickening. This method weakens the tree in the long run and should be applied specifically and thoughtfully. Leaf pruning is the removal of all leaves during the growing season to encourage a second and often finer flush of growth. It should not be done every year because it puts quite a bit of stress on the tree. When pruning, remove all the leaves, but make sure to leave the leaf-stems intact. Partial leaf pruning is a more gentle and less stressful pruning method, so it can be done every year. As the name suggests, partial pruning does not require you to remove all the leaves. Remove the largest leaves, closely spaced leaves, or the leaves in the strongest areas of the tree.",
            "repotting": "The Japanese Maple Bonsai should be repotted every two years. It has strong roots that grow quickly and usually fill the pot in a short time, so be sure to prune the roots efficiently as per the instructions in the repotting Bonsai section. Use a well-drained soil mixture, like Akadama mixed with Pumice and lava rock.",
            "propagation": "The Japanese maple can easily be propagated by planting seeds, cuttings, or air layering in the summer.",
            "buyingInfo": "",
            "pestsAndDeseases": "The Japanese Maple is a very sturdy tree species, but it can be affected by sap-sucking insects known as aphids in spring. Get rid of aphids with a standard insecticide spray, and follow the direction on the label. Verticillium wilt is a fungal disease that can cause the Japanese Maple Bonsai to partially or completely die. This disease is not treatable and can be transmitted to other trees via your Bonsai tools. You can identify it on fresh cuts as black spots in the wood. If you suspect Verticillium is present in your tree(s) be sure to thoroughly clean and disinfect your tools.",
            "generalInformation": "The Japanese Maple (Acer palmatum) belongs to the soap tree family (Sapindaceae) and is originally from Japan, China, and Korea. It owes its botanical name to the hand-shaped leaves with five pointed lobes (but more lobes are possible). Palma is Latin for palm, as in the palm of your hand. In nature the green palmate maple grows shrub-like or as a slender tree and can become up to 15 m tall. The opposite leaves are divided into five to eleven pointed lobes, with toothed edges. In spring the new leaves have a yellowish or orange to bright red colour, depending on the variety or cultivar. The maple is also known and loved for its attractive autumn colours in all shades of yellow, orange and red. The bark of young trees is green or reddish and smooth and turns light grey with age. The reddish flowers have five petals and appear in clusters in May to June. The fruits split into two winged seeds, shaped like a paired winged nut that floats to the ground like propellers when they drop. About 500 cultivars of the species are known, many with special leaf colours or shapes, dwarf growth or interesting bark textures. The Japanese Maple trees are very popular as ornamental shrubs like; Kiyohime, Kashima, Shishigashira, and Arakawa. Red leaved varieties (often referred to as simply a red maple) include the Deshojo and Seigen. The young shoots in spring have yellowish, orange, or even bright red leaves. It's also well-known and popular for its very attractive yellow, orange, and red autumn colors, orange and red maples being the most popular.",
            "imagesURL": [],
            "_id": "6e092a8f-40b2-429d-8f7a-114c98155529"
        }
    },
    "pages": {
        "home": {
            "_id": "home",
            "backgroundImg": "./src/assets/home.jpg",
            "title": "The living art of Bonsai",
            "subtitle": "Bonsai World is a community built by enthusiasts and experts from around the world. We introduce you to the fascinating and living art of Bonsai, and help you get started!"
        },
        "bonsai-care": {
            "_id": "bonsai-care",
            "backgroundImg": "./src/assets/bonsai-care.jpg",
            "thumbImg": "./src/assets/Bonsai-care-techniques.jpg",
            "title": "Bonsai tree care",
            "subtitle": "Bonsai tree care and maintenance",
            "shortDescription": "Caring for a Bonsai tree is not nearly as difficult as it might seem. However, as Bonsai trees are planted in small pots there are a few basic guidelines for placement, watering, and repotting your trees.",
            "generalInformation": {
                "title": "Bonsai tree care",
                "text": "Though Bonsai trees are more delicate than the average indoor plant, a few basic rules should enable anyone to take care of their tree properly. Pay particular attention to where you place it and how to water it properly. <br> In this section of our website we explain the basic and advanced Bonsai care techniques. It is also important to adept these care guidelines to your specific tree species."
            },
            "placement": {
                "title": "Placement",
                "text": "Determining what the optimal spot is to place your Bonsai trees can be hard, as several factors (local climate, time of year, etc.) should be taken into consideration. But the decisive factor is the tree species, and in particular; is your Bonsai an indoor or an outdoor tree?"
            },
            "watering": {
                "title": "Watering",
                "text": "The most important part of taking care of your Bonsai trees is watering. How often a tree needs to be watered depends on several factors such as; species of the tree, size of the tree, size of the pot, time of year, soil-mixture, and climate. I can’t tell you how often you should water Bonsai without knowing what kind of tree you have. However, understanding a few basic guidelines will help understand and identify when a tree needs to be watered."
            },
            "fertilizing": {
                "title": "Fertilizing",
                "text": "Fertilizing regularly during the growing season is crucial for Bonsai to survive and thrive. Trees are usually able to extend their root system in search of nutrients, but since Bonsai are confined to the relatively small pots they are planted in, they need proper fertilization to replenish the soil's nutritional content."
            },
            "repotting": {
                "title": "Repotting",
                "text": "To prevent your Bonsai from being pot-bound and ultimately starving to death, it's crucial to repot, or transplant regularly. A tree becomes pot-bound as it uses up the available nutrients in the soil and the roots grow to the shape of the pot. Due to the lack of space and nutrients, the trees stop growing, and if no action is taken, it will surely die. Repotting or transplanting your Bonsai will resupply the tree with the nutrients it needs to grow and flourish."
            },
            "soil": {
                "title": "Substrate",
                "text": "Using the right soil mixture for your Bonsai trees is crucial. Soil is important to supply your trees with nutrients, but it also needs to drain properly, provide enough aeration, and retain water. Most online Bonsai shops offer ready-mixed soils, but preparing a soil mixture yourself saves money, and gives control over the exact mixture for your particular tree species."
            },
            "potSelection": {
                "title": "Pot selection",
                "text": "A tree is a tree, a pot is only a pot. It does not become a Bonsai until these two are combined and form a harmony together. A large part of the art of Bonsai is the experience of a tree that has become detached from its ground and now lives in a pot."
            },
            "pestsAndDeseases": {
                "title": "Pests and deseases",
                "text": "Like any other living plant, Bonsai trees can be infected by any kind of pest or disease. However, when your plants are healthy and cared for properly, the risk of infection is reduced to a minimum."
            }

        },
        "bonsai-styling": {
            "_id": "bonsai-styling",
            "backgroundImg": "./src/assets/bonsai-styling-bg.jpg",
            "thumbImg": "./src/assets/Styling-and-design-techniques.jpg",
            "title": "Bonsai styling",
            "subtitle": "Styling and shaping Bonsai trees",
            "details": {
                "pruning": "",
                "wiring": "",
                "defoliation": "",
                "deadwood": "",
                "surfaceRoots": "",
                "trunk": ""
            }
        },
        "tree-species": {
            "_id": "tree-species",
            "backgroundImg": "./src/assets/bonsai-species.jpg",
            "thumbImg": "./src/assets/Popular-bonsai-tree-species.jpg",
            "title": "Popular tree species",
            "subtitle": "Care guides for the most popular Bonsai species",
            "shortDescription": "In this section, we'll take a closer look into tree-species that are used for growing Bonsai, and Bonsai tree types. Each tree species has specific requirements for its cultivation, training, and care, so Bonsai tree identification is crucial to take proper care of your tree."
        },
        "create-guide": {
            "_id": "create-guide",
            "backgroundImg": "./src/assets/create-guide.jpg",
            "title": "Create a new guide",
            "subtitle": ""
        }
    },
    "featuredPages": {
        "placement": {
            "_id": "placement",
            "backgroundImg": "./src/assets/Bonsai-techniques-placement.jpg",
            "thumbImg": "./src/assets/Bonsai-techniques-placement-thumb.jpg",
            "title": "Placement",
            "subtitle": "",
            "shortDescription": "Determining what the optimal spot is to place your Bonsai trees can be hard, as several factors (local climate, time of year, etc.) should be taken into consideration. But the decisive factor is the tree species, and in particular; is your Bonsai an indoor or an outdoor tree?"
        },
        "watering": {
            "_id": "watering",
            "backgroundImg": "./src/assets/bonsai-techniques-watering.jpg",
            "thumbImg": "./src/assets/bonsai-techniques-watering-thumb.jpg",
            "title": "Watering",
            "subtitle": "",
            "shortDescription": "The most important part of taking care of your Bonsai trees is watering. How often a tree needs to be watered depends on several factors such as; species of the tree, size of the tree, size of the pot, time of year, soil-mixture, and climate."
        },
        "pruning": {
            "_id": "pruning",
            "backgroundImg": "./src/assets/bonsai-techniques-pruning.jpg",
            "thumbImg": "./src/assets/bonsai-techniques-pruning-thumb.jpg",
            "title": "Pruning",
            "subtitle": "",
            "shortDescription": "Without a doubt, the most important way to style a Bonsai is to prune it regularly. There are two different techniques: maintenance-pruning, to maintain and refine the existing shape of a Bonsai, and a structural pruning, which involves more rigorous pruning to give a tree its basic shape."
        },
        "wiring": {
            "_id": "wiring",
            "backgroundImg": "./src/assets/bonsai-techniques-wire.jpg",
            "thumbImg": "./src/assets/bonsai-techniques-wire-thumb.jpg",
            "title": "Wiring",
            "subtitle": "",
            "shortDescription": "Wiring is a very important technique used to train and style Bonsai trees. By wrapping wire around the branches of a tree you can bend and reposition the branches to your liking. It takes a few months before the branches are set in their new position(s)."
        }
    }
}